[
  {
    "image": "https://media.discordapp.net/attachments/991024902872104981/1003321824555302922/295580695_3290115467902288_3933593817882796934_n.jpg?ex=65f70ac3&is=65e495c3&hm=fb64e56af0db10aa57f5703eff661bc0a9f66df0fa4572188e6c3d5d6c6a03c3&=&format=webp&width=628&height=500",
    "title": "May",
    "description": "Let's starting internship with comeback party...",
    "date": "1 May - 1 June 2023",
    "data": "At the beginning, I must mention that I had worked at this company for a very long time, over 3 years. I started working in my first year as an intern in a cooperative education program for 1 year while I was still studying at the vocational certificate level. After graduating and finishing the internship, the senior executives saw my development and invited me to continue working as a part-time employee. Since then, I have been a part-time employee, but when I started attending university, I had to focus on my studies and didn't often visit the office. This meant I had less contact with them and didn’t see them much, but I continued working for them consistently in a part-time role. When it was time for another full year of co-operative education, I chose to return to the same place because there was still a lot to do, learn, and advance. Coincidentally, the company was in a cooldown phase, so this month we were mainly working on pending tasks, which included writing integration tests to test the entire system of a particular project for the whole month.",
    "dataTh": "ต้องกล่าวถึงในต้นเรื่อง ผมเคยทำงานที่บริษัทนี้มานานมาก เป็นเวลามากกว่า 3 ปี โดย เริ่มทำงานในปีแรก ด้วยบทบาท นักศึกษาฝึกงาน สหกิจ 1 ปี เมื่อตอนยังคงเรียนอยู่ ระดับชั้น ปวส. และเมื่อเรียนจบ และฝึกงานเสร็จสิ้น ทำให้พี่ๆ ผู้บริหารเห็นพัฒนาการในตัวผม จึงได้ติดต่อให้ผมทำงานต่อ โดยรับบทเป็น พนักงาน part time ทำให้ผมเป็นพนักงาน part time มาตั้งแต่ตอนนั้น จนได้เข้ามาเรียน มหาลัย ผมจึงจำเป็นต้องเรียน จึงไม่ค่อยได้เข้าไปที่ออฟฟิส ทำให้ไม่ค่อยได้ติดต่อกับพวกเขา และยังไม่ค่อยได้เจอกัน แต่ผมยังคงทำงานให้เขา ในบทบาท part time มาตลอดอย่างสม่ำเสมอ เมื่อมาถึงช่วงเวลาที่ผมต้องฝึกสหกิจอีก 1 ปีเต็มผมจึงเลือกกลับมาฝึกที่เดิม เพราะที่นี่ยังมีอะไรให้ทำ ให้ศึกษา ให้ต่อยอดอีกมากมาย เขาจึงให้ผมและเหล่าพนักงานได้พักผ่อน เพราะบังเอิญเข้าไปช่วง cooldown ของทาง บริษัทพอดี ในเดือนนี้จึงได้แต่ทำงานที่ค้างคาเอาไว้ ประกอบไปด้วย การเขียน integration test เพื่อทดสอบระบบจริงทั้งหมด ของโปรเจกหนึ่ง ทั้งเดือน"
  },
  {
    "image": "https://media.discordapp.net/attachments/939231737488228375/1194554938521554964/20231103_173525.jpg?ex=65fa9afb&is=65e825fb&hm=e3d42d5bbb2c270d22ed3bff18c7b2994f29f90707023852fbf6931f5217e508&=&format=webp&width=466&height=500",
    "title": "June",
    "description": "Coding and Testing intragration test and unit test...",
    "date": "1 June - 1 July 2023",
    "data": "Coding and testing using integration tests and unit tests with the GO language [Go (programming language)]. Go is a statically typed, compiled programming language designed at Google. It is syntactically similar to C, but with memory safety, garbage collection, structural typing, and CSP-style concurrency. It is sometimes referred to as Golang due to its former domain name, golang.org, but the correct name is Go. For this part of the month, we will continuously conduct integration tests and unit tests for multiple projects. Both my colleague and I will collaborate, handling two projects each, switching roles based on the assigned features.",
    "dataTh": "การเขียนโค้ดและการทดสอบด้วยการทดสอบแบบ integration test และ unit test ด้วยภาษา GO [Go (ภาษาโปรแกรม)] ซึ่ง Go เป็นภาษาที่ถูกคอมไพล์และมีการกำหนดประเภทข้อมูลโดยคงที่ ซึ่งออกแบบขึ้นที่ Google มีความคล้ายคลึงกับภาษา C ในเชิงไวยากรณ์ แต่มีความปลอดภัยด้านหน่วยความจำ, การรวบรวมขยะ, การกำหนดประเภทแบบโครงสร้าง และการทำงานแบบ CSP-style concurrency. บางครั้งมักเรียกว่า Golang เนื่องจากชื่อโดเมนเดิมคือ golang.org แต่ชื่อที่ถูกต้องคือ Go. โดยใน part ของเดือนนี้จะเป็นการทำ integration test และ unit test อย่างต่อเนื่องมากมายหลายโปรเจก โดยมี ผม กับพี่เลี้ยง ร่วมด้วยช่วยกันทำคนละ 2 โปรเจก switch กันทำตาม feature ที่ได้รับมอบหมาย"
  },
  {
    "image": "https://media.discordapp.net/attachments/991024902872104981/991344362959151104/20220606_140205.jpg?ex=65f99c62&is=65e72762&hm=044bd55f7f17c364aa1c2b61fc652f5abfa85f9b25afbff239337943103c82c5&=&format=webp&width=628&height=500",
    "title": "July",
    "description": "Prepared and setup to go to BMAEXPO2023 with twist team...",
    "date": "1 July - 1 August 2023",
    "data": "Coding the integration tests and unit tests has reached its final stage, covering every feature. Then, the seniors started a new project for me to handle. This project involves both hardware and software to control water pumps and report results. So, we gathered for planning meetings, task explanations, and assigned individual research duties. We had frequent meetings to prepare for showcasing this project at BMAEXPO2023.",
    "dataTh": "การเขียน integration test และ unit test ดำเนินการมาจนถึงขั้นสุดท้ายและครบทุก feature แล้วพี่ๆเขาจึงเริ่มโปรเจกใหม่ให้ผมได้ลองจับ โดยในโปรเจกนี้นั้นเป็นโปรเจกที่ต้องใช้ hardware และ software เพื่อควบคุมปั้มน้ำ และ รายงานผล จึงได้รวมตัวประชุมวางแผน และ แจงแจงงานรวมถึงแจงจ่ายงานให้ไปศึกษารายคน จึงประชุมกันบ่อยมาก เพื่อเตรียมนำโปรเจกนี้ไปโชว์ที่งาน BMAEXPO2023"
  },
  {
    "image": "https://media.discordapp.net/attachments/991024902872104981/991344475232288799/2021_1230_03220700.jpg?ex=65f99c7d&is=65e7277d&hm=199387611d10c99498fce901404c2e2237d0d5888132050ff6fd7a0225a0c939&=&format=webp&width=707&height=500",
    "title": "August",
    "description": "Coding Coding Coding Anddddd Testing !!!",
    "date": "1 August - 1 September 2023",
    "data": "This month and the previous one, I studied a hardware called Arduino Uno R3 and a problematic shield named Difobot. This shield is used to transmit data to the internet using 4G in the form of an NB-IOT sim card. This type of sim card is different from regular 4G sim cards; it has an extremely low bandwidth designed specifically for stationary IoT devices, optimizing data transmission and energy consumption. Since I rarely work with hardware, I spent most of the month programming the Difobot to transmit data. However, there were other tasks that I needed to support occasionally.",
    "dataTh": "ในเดือนนี้และเดือนที่ผ่านมาผมได้ศึกษาเกี่ยวกับ hardware ที่มีชื่อว่า arduino uno r3 และ shield เจ้าปัญหา Difobot เป็น shield ที่ใช้สำหรับการ ส่งข้อมูลขึ้นบนระบบ internet ในรูปแบบ 4g โดยเป็น sim card NB-IOT ซึ่ง sim card ประเภทนี้ต่างจาก sim card 4g ทั่วๆไปเป็น sim card ที่มี band width ที่ต่ำมากๆ เพื่อใช้สำหรับ อุปกรณ์ iot ที่อยู่กับที่ไม่ย้ายไปที่ไหน และ ประหยัดการส่งข้อมูล ประหยัดการกินพลังงานมากที่สุด เนื่องด้วยผม ไม่ค่อยได้สัมผัสกับ hardware บ่อยๆ ในเดือนนี้ทั้งเดือนจึงวุ่นวายกับการเขียนโปรเแกรมให้ Difobot สามารถส่งข้อมูลได้นั่นเอง แต่ก็มีงานอื่นๆให้ support อยู่บ้างเป็นบางวัน"
  },
  {
    "image": "https://media.discordapp.net/attachments/991024902872104981/1001148827522302033/20220715_165412.jpg?ex=65f85d80&is=65e5e880&hm=82b5162c34140351b00466fb042a11c70ee9d655b6ec858f3b303d25907f7af7&=&format=webp&width=628&height=500",
    "title": "September",
    "description": "Let's go to BMAEXPO2023..................",
    "date": "1 September - 1 October 2023",
    "data": "And then came the month of project delivery. I had successfully completed my tasks by the end of the previous month, so I was relieved and able to return to other duties. These tasks included supporting customers, addressing system bugs, deploying to production and staging environments on Google Cloud, creating PDF templates through code to insert data from APIs and instantly replace content on the PDF, and many other tasks. At the end of this month, I also participated in an event with my senior colleague, Top.",
    "dataTh": "และแล้วก็ถึงเดือนที่ต้องส่งงานจนได้ ผมที่ทำสำเร็จเรียบร้อยตั้งแต่ สิ้นเดือนที่แล้ว จึงหมดห่วงและ ได้กลับมาทำงานอื่นๆ ต่อเช่น การ support ลูกค้า, การแก้ไขปัญหาของระบบ (bugs), การ deploy production และ staging environment บน google cloud, การสร้าง template pdf ผ่าน code เพื่อใส่ข้อมูลต่างๆ ที่มาจาก api แล้ว replace ลงบน pdf ในทันที และอื่นๆอีกมายมาย และอย่างสุดท้ายของเดือนนี้คือ ออกหน้างาน กับพี่ท็อปผู้เป็นพี่เลี้ยง โดยเจ้าอุปกรณ์ที่เห็นดังภาพเป็นเพียงแค่ prototype ขนาด 1:100"
  },
  {
    "image": "https://media.discordapp.net/attachments/991024902872104981/1214638020544831549/received_143889147877516.png?ex=65f9d6ce&is=65e761ce&hm=1085cc1458022322c2f566ec29614f3b32a73794c1f74bd7ee8ffd57250ce154&=&format=webp&quality=lossless&width=265&height=500",
    "title": "October",
    "description": "Diamons ERP system with new project for work....",
    "date": "1 October - 31 October 2023",
    "data": "After the BMAEXPO2023 event concluded, I was given new responsibilities. Two colleagues at the company had resigned, creating a shortage of support for the ongoing projects. As a result, I was tasked with stepping in to take over some of their roles. I familiarized myself with the flow and various business logic conditions of the systems and began writing integration tests in the early part of the month. The latter half of the month was a crucial period for project delivery, so I was fully focused on fulfilling my responsibilities. This brings us up to the present day",
    "dataTh": "หลังจากจบงาน BMAEXPO2023 ผมก็ได้รับงานใหม่ เนื่องจากมีพี่ที่บริษัท ลาออกเป็นจำนวน 2 คน คนที่ support project ที่บริษัทถืออยู่จึงคนไม่พอ จึงพานพบให้ผมต้องเข้าไปรับผิดชอบแทน ผมจึงเข้าไปทำความรู้จักกับ flow และ business logic condition ต่างๆ ของระบบ แล้วนำมาเขียนตาม integration test ในช่วงต้นเดือน และในช่วงปลายเดือน เป็นช่วงเวลาเห่งการส่งงาน จึงทำให้ผมทำอะไรไม่ได้นอกจากต้องรับผิดชอบในส่วนที่ตัวเองทำ จนถึงปัจจุบัน (ขออนุญาติแปะเตือนตัวเองมีเพิ่มจะต้องมาอัพเดทนะ)"
  },
  {
    "image": "https://media.discordapp.net/attachments/939231737488228375/1215537479667679242/20240306_151016.jpg?ex=65fd1c7e&is=65eaa77e&hm=3492f391aa330102f4eccd8df24fc9f09f207a4f4483368cdb9dacaecf3048f6&=&format=webp&width=780&height=585",
    "title": "November"
  },
  {
    "image": "https://media.discordapp.net/attachments/939231737488228375/1214623214899298386/img_0126.png?ex=65f9c905&is=65e75405&hm=536cee97490b868b998ef58d87582d04c870aaa43981cbf2a9d57b2f24e517d1&=&format=webp&quality=lossless&width=438&height=585",
    "title": "December",
    "description": "-",
    "date": "-",
    "data": "-",
    "dataTh": "-"
  },
  {
    "image": "https://media.discordapp.net/attachments/939231737488228375/1215537482263830559/1706241933081.jpg?ex=65fd1c7f&is=65eaa77f&hm=d1672ee95b6770128108bf4bc613382ae76c6ca00ec64200d02024bb05265701&=&format=webp&width=780&height=585",
    "title": "January",
    "description": "-",
    "date": "-",
    "data": "-",
    "dataTh": "-"
  },
  {
    "image": "https://media.discordapp.net/attachments/991024902872104981/1214638020544831549/received_143889147877516.png?ex=65f9d6ce&is=65e761ce&hm=1085cc1458022322c2f566ec29614f3b32a73794c1f74bd7ee8ffd57250ce154&=&format=webp&quality=lossless&width=265&height=500",
    "title": "February",
    "description": "-",
    "date": "-",
    "data": "-",
    "dataTh": "-"
  },
  {
    "image": "https://media.discordapp.net/attachments/939231737488228375/1215536939399254086/1709756166909.jpg?ex=65fd1bfd&is=65eaa6fd&hm=05a8aa0a10b53c6aa5d2e6a49ff7d801170c62d9a83b15c63cd5b6ee18c392c1&=&format=webp&width=780&height=585",
    "title": "March",
    "description": "-",
    "date": "-",
    "data": "-",
    "dataTh": "-"
  }
]
